{"attic_description":"What secret does the old attic keep? Each thing has its own secret meaning and brings you closer to uncovering the main secret. Feel like real detectives and get to the truth.","attic_title":"An old attic","book":"Book","experiment_descriprion":"You stand on the threshold of a new scientific discovery that will change the fate of mankind. But something is going wrong, and the nuclear reactor, which is operating at full capacity, is signaling an imminent breakdown. Will you be able to repair it in the allotted time and prevent people from dying in this fatal experiment?","experiment_title":"A fatal experiment","hut_description":"You and your friends found yourself in an abandoned hut. What secret does it hide and how to get out of it? You need to find the answer to these questions in order to return home.","hut_title":"A hut in the forest","maniac_description":"In a dimly lit room, several people, strangers to each other, come to their senses. No one remembers what happened last night. Your hands and feet are tied, but one of you managed to free yourself. A frightening timer hangs on the wall and the 60-minute countdown has started. Will you be able to deal with the stressful situation, help others, figure out what happened and get out of the room?","maniac_title":"Maniac","mansion_description":"Immerse yourself in the atmosphere of the backstage office premises, which keep many secrets and mysteries. You will find yourself in an old mansion and see everything that its intricate corridors hide.","mansion_title":"Secrets of the old castle","mars_description":"2055 year. You went to Mars on a research expedition. The goal of the expedition is to colonize the planet. You arrived at the location, set up a temporary camp, built a life support complex and began your work. You have a team of highly qualified specialists in your field. But something goes wrong - now you need to fly off the red planet as soon as possible to save your life.","mars_title":"Mars-2056","metro_description":"The world plunged into post-apocalyptic chaos after a nuclear explosion. All the big cities were wiped off the face of the earth and only in the underground underground life remained. But there is chaos here too. You and your team have only one goal - to survive.","metro_title":"Subway 2033","ritual_description":"The heavy air is oppressive, at night you find yourself locked in a damp room with other victims who do not understand anything. Through the crack in the door, you see how someone in a hood is preparing a platform for a mystical ceremony. Can you make it out before you fall victim to the ritual?","ritual_title":"Ritual","tomb_description":"The medieval cemetery hides many terrible secrets. Local residents say that a vampire count is buried in the crypt, who goes out hunting at night to drink human blood. The sun will set in an hour, will you have time to kill the vampire and get out of the crypt?","tomb_title":"Tomb"}