{"attic_description":"Яку таємницю зберігає старе горище? Кожна річ має свій таємний зміст і наближає до вас до розкриття головної таємниці. Відчуйте себе справжніми детективами та докопайтеся до істини.","attic_title":"Старе горище","book":"Забронювати","experiment_descriprion":"Ви стоїте на порозі нового наукового відкриття, яке переверне долю людства. Але щось йде не так, і ядерний реактор, який працює на повну потужність, сигналізує про швидку поломку. Чи вдасться вам відремонтувати його у відведений час і запобігти загибелі людей у ​​цьому фатальному експерименті?","experiment_title":"Фатальний експеримент","hut_description":"Ви з друзями опинилися в покинутій хатині. Яку таємницю вона приховує і як із неї вибратися? На ці питання вам потрібно знайти відповідь, щоб повернутися додому.","hut_title":"Хижа в лісі","maniac_description":"У кімнаті з приглушеним світлом кілька людей, незнайомих один з одним, приходять до тями. Ніхто не пам'ятає, що сталося минулого вечора. Руки та ноги зв'язані, але одному з вас вдалося звільнитися. На стіні висить таймер, що лякає, і запущений відлік 60 хвилин. Чи зможете ви розібратися в стресовій ситуації, допомогти іншим, розібратися, що сталося і вибратися з кімнати?","maniac_title":"Маньяк","mansion_description":"Пориньте в атмосферу службових приміщень лаштунків, які зберігають безліч таємниць та загадок. Ви опинитеся в старому особняку та побачите все, що приховують його заплутані коридори.","mansion_title":"Таємниці старого замку","mars_description":"2055 рік. Ви поїхали на Марс до науково-дослідної експедиції. Мета експедиції – колонізація планети.  Ви прибули на місце, розгорнули тимчасовий табір, побудували комплекс життєзабезпечення та розпочали свою роботу. У вас є команда висококваліфікованих фахівців у своїй справі. Але щось йде не так - тепер вам потрібно полетіти з червоної планети якнайшвидше, щоб врятувати своє життя.","mars_title":"Марс-2056","metro_description":"Світ поринув у хаос постапокаліпсису після ядерного вибуху. Всі великі міста були стерті з лиця землі і тільки в метро на глибині залишилося життя. Але й тут твориться хаос. У вас і вашої команди є лише одна мета – вижити.","metro_title":"Метро 2033","ritual_description":"Важке повітря пригнічує, в ночі ви опиняєтеся замкненими в сирому приміщенні разом з іншими жертвами, які нічого не розуміють. Крізь щілину у двері ви бачите, як хтось у капюшоні готує майданчик як для проведення містичного обряду. Чи вдасться вам вибратися, доки ви не станете жертвою ритуалу?","ritual_title":"Ритуал","tomb_description":"Середньовічний цвинтар приховує у собі багато страшних таємниць. Місцеві жителі кажуть, що у склепі поховано графа вампіра, який ночами виходить на полювання, щоб випити людської крові. Через годину сонце опуститься за обрій, чи встигнете ви вбити вампіра і вибратися зі склепу?","tomb_title":"Склеп"}